newdigate/teensy-cores/imxrt1176/core_pins.h
// Every digital pin can raise an edge/level interrupt (each pad is a GPIO6/7/8
// bit, all dispatched by attachInterrupt()'s IRQ_GPIO6789 handler).  These
// CORE_INTn_PIN == pin identities let libraries that gate on them (e.g. the
// Encoder library) attach a pin's ISR instead of silently falling back to
// polling.  digitalPinToInterrupt(pin) maps interrupt n straight to pin n.
#define CORE_INT0_PIN		0
#define CORE_INT1_PIN		1
#define CORE_INT2_PIN		2
#define CORE_INT3_PIN		3
#define CORE_INT4_PIN		4
#define CORE_INT5_PIN		5
#define CORE_INT6_PIN		6
#define CORE_INT7_PIN		7
#define CORE_INT8_PIN		8
#define CORE_INT9_PIN		9
#define CORE_INT10_PIN		10
#define CORE_INT11_PIN		11
#define CORE_INT12_PIN		12
#define CORE_INT13_PIN		13
#define CORE_INT14_PIN		14
#define CORE_INT15_PIN		15
#define CORE_INT16_PIN		16
#define CORE_INT17_PIN		17
#define CORE_INT18_PIN		18
#define CORE_INT19_PIN		19
#define CORE_INT20_PIN		20
#define CORE_INT21_PIN		21
#define CORE_INT22_PIN		22
#define CORE_INT23_PIN		23
#define CORE_INT24_PIN		24
#define CORE_INT25_PIN		25
#define CORE_INT26_PIN		26
#define CORE_INT27_PIN		27
#define CORE_INT28_PIN		28
#define CORE_INT29_PIN		29
#define CORE_INT30_PIN		30

#define CORE_PIN0_BIT		23
#define CORE_PIN1_BIT		22
#define CORE_PIN2_BIT		11
#define CORE_PIN3_BIT		24
#define CORE_PIN4_BIT		9
#define CORE_PIN5_BIT		10
#define CORE_PIN6_BIT		18
#define CORE_PIN7_BIT		19
#define CORE_PIN8_BIT		3
#define CORE_PIN9_BIT		2
#define CORE_PIN10_BIT		13
#define CORE_PIN11_BIT		14
#define CORE_PIN12_BIT		15
#define CORE_PIN13_BIT		12
#define CORE_PIN14_BIT		26
#define CORE_PIN15_BIT		27
#define CORE_PIN16_BIT		20
#define CORE_PIN17_BIT		21
#define CORE_PIN18_BIT		17
#define CORE_PIN19_BIT		16

#define CORE_PIN0_BITMASK	(1<<(CORE_PIN0_BIT))
#define CORE_PIN1_BITMASK	(1<<(CORE_PIN1_BIT))
#define CORE_PIN2_BITMASK	(1<<(CORE_PIN2_BIT))
#define CORE_PIN3_BITMASK	(1<<(CORE_PIN3_BIT))
#define CORE_PIN4_BITMASK	(1<<(CORE_PIN4_BIT))
#define CORE_PIN5_BITMASK	(1<<(CORE_PIN5_BIT))
#define CORE_PIN6_BITMASK	(1<<(CORE_PIN6_BIT))
#define CORE_PIN7_BITMASK	(1<<(CORE_PIN7_BIT))
#define CORE_PIN8_BITMASK	(1<<(CORE_PIN8_BIT))
#define CORE_PIN9_BITMASK	(1<<(CORE_PIN9_BIT))
#define CORE_PIN10_BITMASK	(1<<(CORE_PIN10_BIT))
#define CORE_PIN11_BITMASK	(1<<(CORE_PIN11_BIT))
#define CORE_PIN12_BITMASK	(1<<(CORE_PIN12_BIT))
#define CORE_PIN13_BITMASK	(1<<(CORE_PIN13_BIT))
#define CORE_PIN14_BITMASK	(1<<(CORE_PIN14_BIT))
#define CORE_PIN15_BITMASK	(1<<(CORE_PIN15_BIT))
#define CORE_PIN16_BITMASK	(1<<(CORE_PIN16_BIT))
#define CORE_PIN17_BITMASK	(1<<(CORE_PIN17_BIT))
#define CORE_PIN18_BITMASK	(1<<(CORE_PIN18_BIT))
#define CORE_PIN19_BITMASK	(1<<(CORE_PIN19_BIT))

// Fast GPIO: AD_B0/AD_B1 pads -> GPIO6 ; SD_B0 pads -> GPIO8
#define CORE_PIN0_PORTREG	GPIO6_DR
#define CORE_PIN1_PORTREG	GPIO6_DR
#define CORE_PIN2_PORTREG	GPIO6_DR
#define CORE_PIN3_PORTREG	GPIO6_DR
#define CORE_PIN4_PORTREG	GPIO6_DR
#define CORE_PIN5_PORTREG	GPIO6_DR
#define CORE_PIN6_PORTREG	GPIO6_DR
#define CORE_PIN7_PORTREG	GPIO6_DR
#define CORE_PIN8_PORTREG	GPIO6_DR
#define CORE_PIN9_PORTREG	GPIO6_DR
#define CORE_PIN10_PORTREG	GPIO8_DR
#define CORE_PIN11_PORTREG	GPIO8_DR
#define CORE_PIN12_PORTREG	GPIO8_DR
#define CORE_PIN13_PORTREG	GPIO8_DR
#define CORE_PIN14_PORTREG	GPIO6_DR
#define CORE_PIN15_PORTREG	GPIO6_DR
#define CORE_PIN16_PORTREG	GPIO6_DR
#define CORE_PIN17_PORTREG	GPIO6_DR
#define CORE_PIN18_PORTREG	GPIO6_DR
#define CORE_PIN19_PORTREG	GPIO6_DR

#define CORE_PIN0_PORTSET	GPIO6_DR_SET
#define CORE_PIN1_PORTSET	GPIO6_DR_SET
#define CORE_PIN2_PORTSET	GPIO6_DR_SET
#define CORE_PIN3_PORTSET	GPIO6_DR_SET
#define CORE_PIN4_PORTSET	GPIO6_DR_SET
#define CORE_PIN5_PORTSET	GPIO6_DR_SET
#define CORE_PIN6_PORTSET	GPIO6_DR_SET
#define CORE_PIN7_PORTSET	GPIO6_DR_SET
#define CORE_PIN8_PORTSET	GPIO6_DR_SET
#define CORE_PIN9_PORTSET	GPIO6_DR_SET
#define CORE_PIN10_PORTSET	GPIO8_DR_SET
#define CORE_PIN11_PORTSET	GPIO8_DR_SET
#define CORE_PIN12_PORTSET	GPIO8_DR_SET
#define CORE_PIN13_PORTSET	GPIO8_DR_SET
#define CORE_PIN14_PORTSET	GPIO6_DR_SET
#define CORE_PIN15_PORTSET	GPIO6_DR_SET
#define CORE_PIN16_PORTSET	GPIO6_DR_SET
#define CORE_PIN17_PORTSET	GPIO6_DR_SET
#define CORE_PIN18_PORTSET	GPIO6_DR_SET
#define CORE_PIN19_PORTSET	GPIO6_DR_SET

#define CORE_PIN0_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN1_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN2_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN3_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN4_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN5_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN6_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN7_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN8_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN9_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN10_PORTCLEAR	GPIO8_DR_CLEAR
#define CORE_PIN11_PORTCLEAR	GPIO8_DR_CLEAR
#define CORE_PIN12_PORTCLEAR	GPIO8_DR_CLEAR
#define CORE_PIN13_PORTCLEAR	GPIO8_DR_CLEAR
#define CORE_PIN14_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN15_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN16_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN17_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN18_PORTCLEAR	GPIO6_DR_CLEAR
#define CORE_PIN19_PORTCLEAR	GPIO6_DR_CLEAR

#define CORE_PIN0_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN1_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN2_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN3_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN4_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN5_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN6_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN7_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN8_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN9_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN10_PORTTOGGLE	GPIO8_DR_TOGGLE
#define CORE_PIN11_PORTTOGGLE	GPIO8_DR_TOGGLE
#define CORE_PIN12_PORTTOGGLE	GPIO8_DR_TOGGLE
#define CORE_PIN13_PORTTOGGLE	GPIO8_DR_TOGGLE
#define CORE_PIN14_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN15_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN16_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN17_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN18_PORTTOGGLE	GPIO6_DR_TOGGLE
#define CORE_PIN19_PORTTOGGLE	GPIO6_DR_TOGGLE

